import random

print("=== Задача B ===") 
lastNumber = 90 # Последний номер бочонка в Русском лото.
input("Нажмите Enter, чтобы начать программу.") # Для коректной работы EXE-файла (и для красоты)
times = int(input('Сколько "выигрышных" номеров необходимо вывести?: ')) # Количество "выигрышных" номеров.

randomNumbers = random.sample(range(1, lastNumber + 1), k=times) # random.sample - метод случайной выборки.
print(randomNumbers)

print("Создал: Стрекачев Владимир, 2021")
input("Нажмите Enter, чтобы завершить программу.") # Для коректной работы EXE-файла (и для красоты)