import math

print("=== Задача A ===")
input("Нажмите Enter для начала работы программы.") # Для красоты

n = float(input("Введите пароль: ")) # Принимаем значение

# Формула:
n = n ** 2 * 10 # Cначала - степень, потом - умножение
math.floor(n) # math.floor - ПРИНУДИТЕЛЬНОЕ округление в МЕНЬШУЮ сторону
n = n % 10 
n = math.floor(n) # math.floor - ПРИНУДИТЕЛЬНОЕ округление в МЕНЬШУЮ сторону

print("Число-ответ: " + str(n)) # Формируем ответ
print("Создал: Стрекачев Владимир, 2021")
input("Нажмите Enter для завершения работы программы.") # Для корректной работы EXE-файла (и для красоты)